rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
static const AppAI_ModelStageSpec app_ai_obb_stage = {
	.stage_label = "qarepvgg_pro",
	.model_image_path = APP_AI_OBB_XSPI2_MODEL_IMAGE_PATH,
	.nn_instance = &NN_Instance_qarepvgg_pro_a175_int8,
	.network_init_fn = LL_ATON_EC_Network_Init_qarepvgg_pro_a175_int8,
	.inference_init_fn = LL_ATON_EC_Inference_Init_qarepvgg_pro_a175_int8,
	.uses_rectifier_box = false,
	.xspi2_chip_offset = APP_AI_XSPI2_OBB_CHIP_OFFSET,
	.xspi2_base_addr = APP_AI_XSPI2_OBB_BASE_ADDR,
};

static bool AppAI_ShouldLogStageDiagnostics(
	const AppAI_ModelStageSpec *stage)
{
	(void)stage;
	return true;
}

/* QARepVGG-Pro bridge — replaces AppAI_DecodeObbCropBox.
 * output_buffers_info array: [0]=angle, [1]=box, [2]=heatmap, [3]=NULL terminator.
 * All tensors are int8, ch-first, at NPU RAM5 base (0x342E0000). */
static bool AppAI_DecodeQarepvggObb(
    const LL_Buffer_InfoTypeDef *output_info,
    AppAI_SourceCrop            *obb_crop,
    AppAI_ObbBox                *obb_box)
{
	if ((output_info == NULL) || (obb_crop == NULL) || (obb_box == NULL))
	{
		return false;
	}

	/* output_info points to index 0 (Transpose_53_out_0 = angle).
	 * Index 1 = Transpose_59_out_0 = box, index 2 = Transpose_50_out_0 = heatmap. */
	const LL_Buffer_InfoTypeDef *angle_info   = &output_info[QAREPVGG_OUTPUT_IDX_ANGLE];
	const LL_Buffer_InfoTypeDef *box_info     = &output_info[QAREPVGG_OUTPUT_IDX_BOX];
	const LL_Buffer_InfoTypeDef *heatmap_info = &output_info[QAREPVGG_OUTPUT_IDX_HEATMAP];

	/* Verify all three entries are present (non-NULL name). */
	if ((angle_info->name == NULL) || (box_info->name == NULL) || (heatmap_info->name == NULL))
	{
		return false;
	}

	const int8_t *heatmap_raw = (const int8_t *)LL_Buffer_addr_start(heatmap_info);
	const int8_t *box_raw     = (const int8_t *)LL_Buffer_addr_start(box_info);
	const int8_t *angle_raw   = (const int8_t *)LL_Buffer_addr_start(angle_info);

	if ((heatmap_raw == NULL) || (box_raw == NULL) || (angle_raw == NULL))
	{
		return false;
	}

	QarepvggOutput q_out;
	AppAI_DecodeQarepvggOutput(&q_out,
		heatmap_raw, box_raw, angle_raw,
		APP_AI_OBB_HEATMAP_SCALE,   APP_AI_OBB_HEATMAP_ZP,
		APP_AI_OBB_BOX_SCALE,       APP_AI_OBB_BOX_ZP,
		APP_AI_OBB_ANGLE_SCALE,     APP_AI_OBB_ANGLE_ZP);

	if (!q_out.valid)
	{
		return false;
	}

	/* Populate OBB box with normalised [0,1] values. */
	obb_box->center_x = q_out.center_x;
	obb_box->center_y = q_out.center_y;
	obb_box->box_w    = q_out.box_w;
	obb_box->box_h    = q_out.box_h;

	/* θ = 0.5 * atan2(sin2θ, cos2θ) — gauge rotation in radians. */
	obb_box->angle_rad    = atan2f(q_out.sin2theta, q_out.cos2theta) * 0.5f;
	obb_box->confidence   = q_out.peak_value;
	obb_box->gauge_center_x = q_out.center_x;
	obb_box->gauge_center_y = q_out.center_y;

	/* Populate pixel crop from centre + box size, with OBB crop scale. */
	float cx_px = q_out.center_x * (float)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	float cy_px = q_out.center_y * (float)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
	float bw_px = q_out.box_w    * (float)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	float bh_px = q_out.box_h    * (float)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;

	float crop_w = bw_px * APP_AI_OBB_CROP_SCALE;
	float crop_h = bh_px * APP_AI_OBB_CROP_SCALE;

	/* Clamp crop to frame bounds. */
	float x_min_f = cx_px - crop_w * 0.5f;
	float y_min_f = cy_px - crop_h * 0.5f;

	if (x_min_f < 0.0f) { x_min_f = 0.0f; }
	if (y_min_f < 0.0f) { y_min_f = 0.0f; }
	if ((x_min_f + crop_w) > (float)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS)
	{
		crop_w = (float)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS - x_min_f;
	}
	if ((y_min_f + crop_h) > (float)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS)
	{
		crop_h = (float)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS - y_min_f;
	}
	if ((crop_w < APP_AI_OBB_MIN_CROP_SIZE_PIXELS) || (crop_h < APP_AI_OBB_MIN_CROP_SIZE_PIXELS))
	{
		return false;   /* degenerate crop — reject */
	}

	obb_crop->x_min  = (size_t)(x_min_f + 0.5f);
	obb_crop->y_min  = (size_t)(y_min_f + 0.5f);
	obb_crop->width  = (size_t)(crop_w + 0.5f);
	obb_crop->height = (size_t)(crop_h + 0.5f);

	return true;
}

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/

/* Split helper implementation into a companion include to keep this file manageable. */
#include "app_ai_helpers.inc"

/* Split out the runtime tail into a companion include to keep this file manageable. */
#include "app_ai_runtime_tail.inc"
